{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "32666024",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: langchain-neo4j>=0.2.0 in /opt/homebrew/lib/python3.11/site-packages (from -r requirements.txt (line 1)) (0.4.0)\n",
      "Requirement already satisfied: langchain-groq>=0.3.6 in /opt/homebrew/lib/python3.11/site-packages (from -r requirements.txt (line 2)) (0.3.6)\n",
      "Collecting langchain-community>=0.3.27 (from -r requirements.txt (line 3))\n",
      "  Using cached langchain_community-0.3.27-py3-none-any.whl.metadata (2.9 kB)\n",
      "Collecting langchain-experimental>=0.3.4 (from -r requirements.txt (line 4))\n",
      "  Downloading langchain_experimental-0.3.4-py3-none-any.whl.metadata (1.7 kB)\n",
      "Collecting wikipedia>=1.4.0 (from -r requirements.txt (line 5))\n",
      "  Downloading wikipedia-1.4.0.tar.gz (27 kB)\n",
      "  Preparing metadata (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25hRequirement already satisfied: tiktoken>=0.9.0 in /opt/homebrew/lib/python3.11/site-packages (from -r requirements.txt (line 6)) (0.9.0)\n",
      "Requirement already satisfied: neo4j>=5.27.0 in /opt/homebrew/lib/python3.11/site-packages (from -r requirements.txt (line 7)) (5.28.1)\n",
      "Requirement already satisfied: python-dotenv>=1.0.1 in /opt/homebrew/lib/python3.11/site-packages (from -r requirements.txt (line 8)) (1.1.1)\n",
      "Requirement already satisfied: ipykernel>=6.29.5 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from -r requirements.txt (line 9)) (6.29.5)\n",
      "Requirement already satisfied: langchain<0.4.0,>=0.3.7 in /opt/homebrew/lib/python3.11/site-packages (from langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.3.26)\n",
      "Requirement already satisfied: langchain-core<0.4.0,>=0.3.8 in /opt/homebrew/lib/python3.11/site-packages (from langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.3.70)\n",
      "Requirement already satisfied: neo4j-graphrag<2.0.0,>=1.5.0 in /opt/homebrew/lib/python3.11/site-packages (from langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (1.8.0)\n",
      "Requirement already satisfied: pytz in /opt/homebrew/lib/python3.11/site-packages (from neo4j>=5.27.0->-r requirements.txt (line 7)) (2025.2)\n",
      "Requirement already satisfied: langchain-text-splitters<1.0.0,>=0.3.8 in /opt/homebrew/lib/python3.11/site-packages (from langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.3.8)\n",
      "Requirement already satisfied: langsmith>=0.1.17 in /opt/homebrew/lib/python3.11/site-packages (from langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.4.8)\n",
      "Requirement already satisfied: pydantic<3.0.0,>=2.7.4 in /opt/homebrew/lib/python3.11/site-packages (from langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2.11.7)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in /opt/homebrew/lib/python3.11/site-packages (from langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2.0.41)\n",
      "Requirement already satisfied: requests<3,>=2 in /opt/homebrew/lib/python3.11/site-packages (from langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2.32.4)\n",
      "Requirement already satisfied: PyYAML>=5.3 in /opt/homebrew/lib/python3.11/site-packages (from langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (6.0.2)\n",
      "Requirement already satisfied: tenacity!=8.4.0,<10.0.0,>=8.1.0 in /opt/homebrew/lib/python3.11/site-packages (from langchain-core<0.4.0,>=0.3.8->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (9.1.2)\n",
      "Requirement already satisfied: jsonpatch<2.0,>=1.33 in /opt/homebrew/lib/python3.11/site-packages (from langchain-core<0.4.0,>=0.3.8->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (1.33)\n",
      "Requirement already satisfied: typing-extensions>=4.7 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from langchain-core<0.4.0,>=0.3.8->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (4.14.1)\n",
      "Requirement already satisfied: packaging>=23.2 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from langchain-core<0.4.0,>=0.3.8->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (25.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in /opt/homebrew/lib/python3.11/site-packages (from jsonpatch<2.0,>=1.33->langchain-core<0.4.0,>=0.3.8->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (3.0.0)\n",
      "Requirement already satisfied: fsspec<2025.0.0,>=2024.9.0 in /opt/homebrew/lib/python3.11/site-packages (from neo4j-graphrag<2.0.0,>=1.5.0->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2024.12.0)\n",
      "Requirement already satisfied: json-repair<0.40.0,>=0.39.1 in /opt/homebrew/lib/python3.11/site-packages (from neo4j-graphrag<2.0.0,>=1.5.0->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.39.1)\n",
      "Requirement already satisfied: numpy<3.0.0,>=2.0.0 in /opt/homebrew/lib/python3.11/site-packages (from neo4j-graphrag<2.0.0,>=1.5.0->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2.2.6)\n",
      "Requirement already satisfied: pypdf<6.0.0,>=5.1.0 in /opt/homebrew/lib/python3.11/site-packages (from neo4j-graphrag<2.0.0,>=1.5.0->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (5.8.0)\n",
      "Requirement already satisfied: scipy<2.0.0,>=1.13.0 in /opt/homebrew/lib/python3.11/site-packages (from neo4j-graphrag<2.0.0,>=1.5.0->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (1.16.0)\n",
      "Requirement already satisfied: types-pyyaml<7.0.0.0,>=6.0.12.20240917 in /opt/homebrew/lib/python3.11/site-packages (from neo4j-graphrag<2.0.0,>=1.5.0->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (6.0.12.20250516)\n",
      "Requirement already satisfied: annotated-types>=0.6.0 in /opt/homebrew/lib/python3.11/site-packages (from pydantic<3.0.0,>=2.7.4->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.7.0)\n",
      "Requirement already satisfied: pydantic-core==2.33.2 in /opt/homebrew/lib/python3.11/site-packages (from pydantic<3.0.0,>=2.7.4->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2.33.2)\n",
      "Requirement already satisfied: typing-inspection>=0.4.0 in /opt/homebrew/lib/python3.11/site-packages (from pydantic<3.0.0,>=2.7.4->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.4.1)\n",
      "Requirement already satisfied: charset_normalizer<4,>=2 in /opt/homebrew/lib/python3.11/site-packages (from requests<3,>=2->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (3.4.2)\n",
      "Requirement already satisfied: idna<4,>=2.5 in /opt/homebrew/lib/python3.11/site-packages (from requests<3,>=2->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (3.10)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/homebrew/lib/python3.11/site-packages (from requests<3,>=2->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2.5.0)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /opt/homebrew/lib/python3.11/site-packages (from requests<3,>=2->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (2025.6.15)\n",
      "Requirement already satisfied: groq<1,>=0.29.0 in /opt/homebrew/lib/python3.11/site-packages (from langchain-groq>=0.3.6->-r requirements.txt (line 2)) (0.30.0)\n",
      "Requirement already satisfied: anyio<5,>=3.5.0 in /opt/homebrew/lib/python3.11/site-packages (from groq<1,>=0.29.0->langchain-groq>=0.3.6->-r requirements.txt (line 2)) (4.9.0)\n",
      "Requirement already satisfied: distro<2,>=1.7.0 in /opt/homebrew/lib/python3.11/site-packages (from groq<1,>=0.29.0->langchain-groq>=0.3.6->-r requirements.txt (line 2)) (1.9.0)\n",
      "Requirement already satisfied: httpx<1,>=0.23.0 in /opt/homebrew/lib/python3.11/site-packages (from groq<1,>=0.29.0->langchain-groq>=0.3.6->-r requirements.txt (line 2)) (0.28.1)\n",
      "Requirement already satisfied: sniffio in /opt/homebrew/lib/python3.11/site-packages (from groq<1,>=0.29.0->langchain-groq>=0.3.6->-r requirements.txt (line 2)) (1.3.1)\n",
      "Requirement already satisfied: httpcore==1.* in /opt/homebrew/lib/python3.11/site-packages (from httpx<1,>=0.23.0->groq<1,>=0.29.0->langchain-groq>=0.3.6->-r requirements.txt (line 2)) (1.0.9)\n",
      "Requirement already satisfied: h11>=0.16 in /opt/homebrew/lib/python3.11/site-packages (from httpcore==1.*->httpx<1,>=0.23.0->groq<1,>=0.29.0->langchain-groq>=0.3.6->-r requirements.txt (line 2)) (0.16.0)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /opt/homebrew/lib/python3.11/site-packages (from langchain-community>=0.3.27->-r requirements.txt (line 3)) (3.12.13)\n",
      "Collecting dataclasses-json<0.7,>=0.5.7 (from langchain-community>=0.3.27->-r requirements.txt (line 3))\n",
      "  Using cached dataclasses_json-0.6.7-py3-none-any.whl.metadata (25 kB)\n",
      "Collecting pydantic-settings<3.0.0,>=2.4.0 (from langchain-community>=0.3.27->-r requirements.txt (line 3))\n",
      "  Using cached pydantic_settings-2.10.1-py3-none-any.whl.metadata (3.4 kB)\n",
      "Collecting httpx-sse<1.0.0,>=0.4.0 (from langchain-community>=0.3.27->-r requirements.txt (line 3))\n",
      "  Using cached httpx_sse-0.4.1-py3-none-any.whl.metadata (9.4 kB)\n",
      "Requirement already satisfied: aiohappyeyeballs>=2.5.0 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (2.6.1)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (1.4.0)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (25.3.0)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (1.7.0)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (6.6.3)\n",
      "Requirement already satisfied: propcache>=0.2.0 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (0.3.2)\n",
      "Requirement already satisfied: yarl<2.0,>=1.17.0 in /opt/homebrew/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community>=0.3.27->-r requirements.txt (line 3)) (1.20.1)\n",
      "Collecting marshmallow<4.0.0,>=3.18.0 (from dataclasses-json<0.7,>=0.5.7->langchain-community>=0.3.27->-r requirements.txt (line 3))\n",
      "  Using cached marshmallow-3.26.1-py3-none-any.whl.metadata (7.3 kB)\n",
      "Collecting typing-inspect<1,>=0.4.0 (from dataclasses-json<0.7,>=0.5.7->langchain-community>=0.3.27->-r requirements.txt (line 3))\n",
      "  Using cached typing_inspect-0.9.0-py3-none-any.whl.metadata (1.5 kB)\n",
      "Collecting mypy-extensions>=0.3.0 (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain-community>=0.3.27->-r requirements.txt (line 3))\n",
      "  Using cached mypy_extensions-1.1.0-py3-none-any.whl.metadata (1.1 kB)\n",
      "Collecting beautifulsoup4 (from wikipedia>=1.4.0->-r requirements.txt (line 5))\n",
      "  Using cached beautifulsoup4-4.13.4-py3-none-any.whl.metadata (3.8 kB)\n",
      "Requirement already satisfied: regex>=2022.1.18 in /opt/homebrew/lib/python3.11/site-packages (from tiktoken>=0.9.0->-r requirements.txt (line 6)) (2024.11.6)\n",
      "Requirement already satisfied: appnope in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.1.4)\n",
      "Requirement already satisfied: comm>=0.1.1 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.2.2)\n",
      "Requirement already satisfied: debugpy>=1.6.5 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (1.8.14)\n",
      "Requirement already satisfied: ipython>=7.23.1 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (9.4.0)\n",
      "Requirement already satisfied: jupyter-client>=6.1.12 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (8.6.3)\n",
      "Requirement already satisfied: jupyter-core!=5.0.*,>=4.12 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (5.8.1)\n",
      "Requirement already satisfied: matplotlib-inline>=0.1 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.1.7)\n",
      "Requirement already satisfied: nest-asyncio in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (1.6.0)\n",
      "Requirement already satisfied: psutil in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (7.0.0)\n",
      "Requirement already satisfied: pyzmq>=24 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (27.0.0)\n",
      "Requirement already satisfied: tornado>=6.1 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (6.5.1)\n",
      "Requirement already satisfied: traitlets>=5.4.0 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipykernel>=6.29.5->-r requirements.txt (line 9)) (5.14.3)\n",
      "Requirement already satisfied: decorator in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (5.2.1)\n",
      "Requirement already satisfied: ipython-pygments-lexers in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (1.1.1)\n",
      "Requirement already satisfied: jedi>=0.16 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.19.2)\n",
      "Requirement already satisfied: pexpect>4.3 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (4.9.0)\n",
      "Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (3.0.51)\n",
      "Requirement already satisfied: pygments>=2.4.0 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (2.19.2)\n",
      "Requirement already satisfied: stack_data in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.6.3)\n",
      "Requirement already satisfied: wcwidth in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from prompt_toolkit<3.1.0,>=3.0.41->ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.2.13)\n",
      "Requirement already satisfied: parso<0.9.0,>=0.8.4 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from jedi>=0.16->ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.8.4)\n",
      "Requirement already satisfied: python-dateutil>=2.8.2 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from jupyter-client>=6.1.12->ipykernel>=6.29.5->-r requirements.txt (line 9)) (2.9.0.post0)\n",
      "Requirement already satisfied: platformdirs>=2.5 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from jupyter-core!=5.0.*,>=4.12->ipykernel>=6.29.5->-r requirements.txt (line 9)) (4.3.8)\n",
      "Requirement already satisfied: orjson<4.0.0,>=3.9.14 in /opt/homebrew/lib/python3.11/site-packages (from langsmith>=0.1.17->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (3.10.18)\n",
      "Requirement already satisfied: requests-toolbelt<2.0.0,>=1.0.0 in /opt/homebrew/lib/python3.11/site-packages (from langsmith>=0.1.17->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (1.0.0)\n",
      "Requirement already satisfied: zstandard<0.24.0,>=0.23.0 in /opt/homebrew/lib/python3.11/site-packages (from langsmith>=0.1.17->langchain<0.4.0,>=0.3.7->langchain-neo4j>=0.2.0->-r requirements.txt (line 1)) (0.23.0)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from pexpect>4.3->ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.7.0)\n",
      "Requirement already satisfied: six>=1.5 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from python-dateutil>=2.8.2->jupyter-client>=6.1.12->ipykernel>=6.29.5->-r requirements.txt (line 9)) (1.17.0)\n",
      "Collecting soupsieve>1.2 (from beautifulsoup4->wikipedia>=1.4.0->-r requirements.txt (line 5))\n",
      "  Using cached soupsieve-2.7-py3-none-any.whl.metadata (4.6 kB)\n",
      "Requirement already satisfied: executing>=1.2.0 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from stack_data->ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (2.2.0)\n",
      "Requirement already satisfied: asttokens>=2.1.0 in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from stack_data->ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (3.0.0)\n",
      "Requirement already satisfied: pure-eval in /Users/jayanthsattineni/Library/Python/3.11/lib/python/site-packages (from stack_data->ipython>=7.23.1->ipykernel>=6.29.5->-r requirements.txt (line 9)) (0.2.3)\n",
      "Using cached langchain_community-0.3.27-py3-none-any.whl (2.5 MB)\n",
      "Using cached dataclasses_json-0.6.7-py3-none-any.whl (28 kB)\n",
      "Using cached httpx_sse-0.4.1-py3-none-any.whl (8.1 kB)\n",
      "Using cached marshmallow-3.26.1-py3-none-any.whl (50 kB)\n",
      "Using cached pydantic_settings-2.10.1-py3-none-any.whl (45 kB)\n",
      "Using cached typing_inspect-0.9.0-py3-none-any.whl (8.8 kB)\n",
      "Downloading langchain_experimental-0.3.4-py3-none-any.whl (209 kB)\n",
      "Using cached mypy_extensions-1.1.0-py3-none-any.whl (5.0 kB)\n",
      "Using cached beautifulsoup4-4.13.4-py3-none-any.whl (187 kB)\n",
      "Using cached soupsieve-2.7-py3-none-any.whl (36 kB)\n",
      "Building wheels for collected packages: wikipedia\n",
      "\u001b[33m  DEPRECATION: Building 'wikipedia' using the legacy setup.py bdist_wheel mechanism, which will be removed in a future version. pip 25.3 will enforce this behaviour change. A possible replacement is to use the standardized build interface by setting the `--use-pep517` option, (possibly combined with `--no-build-isolation`), or adding a `pyproject.toml` file to the source tree of 'wikipedia'. Discussion can be found at https://github.com/pypa/pip/issues/6334\u001b[0m\u001b[33m\n",
      "\u001b[0m  Building wheel for wikipedia (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25h  Created wheel for wikipedia: filename=wikipedia-1.4.0-py3-none-any.whl size=11757 sha256=0c7c8ce2e0506af7c6d1813e6aaa34c2b1ec54039f453093fd1b9c1c7d88e98d\n",
      "  Stored in directory: /Users/jayanthsattineni/Library/Caches/pip/wheels/8f/ab/cb/45ccc40522d3a1c41e1d2ad53b8f33a62f394011ec38cd71c6\n",
      "Successfully built wikipedia\n",
      "Installing collected packages: soupsieve, mypy-extensions, marshmallow, httpx-sse, typing-inspect, beautifulsoup4, wikipedia, pydantic-settings, dataclasses-json, langchain-community, langchain-experimental\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m11/11\u001b[0m [langchain-experimental]hain-experimental]\n",
      "\u001b[1A\u001b[2KSuccessfully installed beautifulsoup4-4.13.4 dataclasses-json-0.6.7 httpx-sse-0.4.1 langchain-community-0.3.27 langchain-experimental-0.3.4 marshmallow-3.26.1 mypy-extensions-1.1.0 pydantic-settings-2.10.1 soupsieve-2.7 typing-inspect-0.9.0 wikipedia-1.4.0\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "pip install -r requirements.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "088d5ead",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in /opt/homebrew/lib/python3.11/site-packages (5.28.1)\n",
      "Requirement already satisfied: pytz in /opt/homebrew/lib/python3.11/site-packages (from neo4j) (2025.2)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "8589d28c",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "from langchain_groq import ChatGroq\n",
    "from langchain_neo4j  import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv(override=True)\n",
    "\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "from langchain_community.document_loaders import WikipediaLoader\n",
    "from langchain.text_splitter import TokenTextSplitter\n",
    "\n",
    "from langchain_community.vectorstores.neo4j_vector import remove_lucene_chars\n",
    "from langchain_core.prompts import ChatPromptTemplate"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "088e8bb3",
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "Neo4jGraph.__init__() got an unexpected keyword argument 'database_config'",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mTypeError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[59]\u001b[39m\u001b[32m, line 1\u001b[39m\n\u001b[32m----> \u001b[39m\u001b[32m1\u001b[39m kg = \u001b[43mNeo4jGraph\u001b[49m\u001b[43m(\u001b[49m\n\u001b[32m      2\u001b[39m \u001b[43m    \u001b[49m\u001b[43murl\u001b[49m\u001b[43m=\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mneo4j://127.0.0.1:7687\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43musername\u001b[49m\u001b[43m=\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mneo4j\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mpassword\u001b[49m\u001b[43m=\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43muser@123\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43menhanced_schema\u001b[49m\u001b[43m=\u001b[49m\u001b[38;5;28;43;01mTrue\u001b[39;49;00m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mdatabase_config\u001b[49m\u001b[43m=\u001b[49m\u001b[43m{\u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mnotifications_min_severity\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[33;43m\"\u001b[39;49m\u001b[33;43mERROR\u001b[39;49m\u001b[33;43m\"\u001b[39;49m\u001b[43m}\u001b[49m\n\u001b[32m      3\u001b[39m \u001b[43m)\u001b[49m\n",
      "\u001b[31mTypeError\u001b[39m: Neo4jGraph.__init__() got an unexpected keyword argument 'database_config'"
     ]
    }
   ],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=\"neo4j://127.0.0.1:7687\", username=\"neo4j\", password=\"user@123\", enhanced_schema=True, \n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53796867",
   "metadata": {},
   "source": [
    "# Wipe Out The DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "1841a8ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"MATCH(n) DETACH DELETE n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4ae0aa31",
   "metadata": {},
   "source": [
    "# Initialize LLM"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "32959212",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatGroq(temperature=0, groq_api_key=os.environ['GROQ_KEY'], model_name=\"llama-3.3-70b-versatile\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "7287c0ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/homebrew/lib/python3.11/site-packages/wikipedia/wikipedia.py:389: GuessedAtParserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system (\"html.parser\"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.\n",
      "\n",
      "The code that caused this warning is on line 389 of the file /opt/homebrew/lib/python3.11/site-packages/wikipedia/wikipedia.py. To get rid of this warning, pass the additional argument 'features=\"html.parser\"' to the BeautifulSoup constructor.\n",
      "\n",
      "  lis = BeautifulSoup(html).find_all('li')\n"
     ]
    }
   ],
   "source": [
    "raw_documents = WikipediaLoader(query=\"Ramayana\").load()\n",
    "text_splitter = TokenTextSplitter(chunk_size=512, chunk_overlap=24)\n",
    "documents = text_splitter.split_documents(raw_documents[:3])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c6c068f",
   "metadata": {},
   "source": [
    "# Generate Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "4ab82ebd",
   "metadata": {},
   "outputs": [],
   "source": [
    "transformer = LLMGraphTransformer(llm=llm)\n",
    "graph_documents = transformer.convert_to_graph_documents(documents)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0035d369",
   "metadata": {},
   "source": [
    "# Ingest Data To KG"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "e472f0c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "kg.add_graph_documents(\n",
    "  graph_documents, \n",
    "  baseEntityLabel=True, \n",
    "  include_source=True\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c34ea035",
   "metadata": {},
   "source": [
    "# Create FULL TEXT INDEX"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "3d47f3c1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\n",
    "    \"CREATE FULLTEXT INDEX entity IF NOT EXISTS FOR (e:__Entity__) ON EACH [e.id]\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e440db94",
   "metadata": {},
   "source": [
    "# Schema Visualization"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "d62dec04",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "- **Document**\n",
      "  - `id`: STRING Available options: ['95376fe4974ad6af7ed541292732f6e6', '943f711142ed09016566c94df41c4289', '077c764928f6df391f2bc56c8fb1fb60', '16bf162388d87cdbbf595b5e856b3857', 'c19c9b670ba929dd23fa7f760fc29b77', '98926dcad461da97ee60f6dfa7a3dbfa', '692722004c6121da2b2db5da2984e8fe', 'c9ced462c75058643845b3a325db5f33']\n",
      "  - `text`: STRING Available options: [' Buddhist. Its most important moral influence was ', ' narrative contradictions between these two volume', 'Ramayana: The Legend of Prince Rama is a 1993 anim', ' Bulbul Mukherjee – Dasharatha Madhulika Varma – K', ' B. B. Lal near Allahabad in Uttar Pradesh (India)', 'Rama (; Sanskrit: राम, IAST: Rāma, Sanskrit: [ˈraː', ' significantly from the Hindu versions. Jain Texts', 'The Ramayana (; Sanskrit: रामायणम्, romanized: Rām']\n",
      "  - `summary`: STRING Available options: ['The Ramayana (; Sanskrit: रामायणम्, romanized: Rām', 'Ramayana: The Legend of Prince Rama is a 1993 anim', 'Rama (; Sanskrit: राम, IAST: Rāma, Sanskrit: [ˈraː']\n",
      "  - `source`: STRING Available options: ['https://en.wikipedia.org/wiki/Ramayana', 'https://en.wikipedia.org/wiki/Ramayana:_The_Legend', 'https://en.wikipedia.org/wiki/Rama']\n",
      "  - `title`: STRING Available options: ['Ramayana', 'Ramayana: The Legend of Prince Rama', 'Rama']\n",
      "- **Epic**\n",
      "  - `id`: STRING Available options: ['Ramayana']\n",
      "- **Author**\n",
      "  - `id`: STRING Available options: ['Valmiki']\n",
      "- **Prince**\n",
      "  - `id`: STRING Available options: ['Rama', 'Lakshmana']\n",
      "- **Deity**\n",
      "  - `id`: STRING Available options: ['Rama', 'Vishnu']\n",
      "- **Kingdom**\n",
      "  - `id`: STRING Available options: ['Ayodhya', 'Kosala', 'Lanka', 'Magadha']\n",
      "- **King**\n",
      "  - `id`: STRING Available options: ['King Dasharatha', 'Ravana']\n",
      "- **Queen**\n",
      "  - `id`: STRING Available options: ['Kaikeyi', 'Sita']\n",
      "- **State**\n",
      "  - `id`: STRING Available options: ['Rāmarājya']\n",
      "- **Person**\n",
      "  - `id`: STRING Example: \"Rama\"\n",
      "- **Religion**\n",
      "  - `id`: STRING Available options: ['Buddhism', 'Hinduism', 'Jainism', 'Sikhism']\n",
      "- **Text**\n",
      "  - `id`: STRING Available options: ['Atharvaveda', 'Mahabharata', 'Atharva Veda', 'Rigveda']\n",
      "- **City**\n",
      "  - `id`: STRING Available options: ['Ayodhya', 'Saketa', 'Shravasti']\n",
      "- **Scholar**\n",
      "  - `id`: STRING Available options: ['Hermann Jacobi']\n",
      "- **Film**\n",
      "  - `id`: STRING Available options: ['Ramayana: The Legend Of Prince Rama']\n",
      "- **Country**\n",
      "  - `id`: STRING Available options: ['India', 'Japan']\n",
      "- **Festival**\n",
      "  - `id`: STRING Available options: ['24Th International Film Festival Of India', '1993 Vancouver International Film Festival', 'Rama Navami']\n",
      "- **Location**\n",
      "  - `id`: STRING Available options: ['Ayodhya', 'Lanka', 'India', 'Panchavati', 'Kishkindha', 'Allahabad', 'Uttar Pradesh']\n",
      "- **Actor**\n",
      "  - `id`: STRING Example: \"Bulbul Mukherjee\"\n",
      "- **Character**\n",
      "  - `id`: STRING Example: \"Rama\"\n",
      "- **Documentary film**\n",
      "  - `id`: STRING Available options: ['The Ramayana Relics']\n",
      "- **Story**\n",
      "  - `id`: STRING Available options: ['Ramayana']\n",
      "- **Documentary**\n",
      "  - `id`: STRING Available options: ['The Ramayana Relics']\n",
      "- **Newspaper**\n",
      "  - `id`: STRING Available options: ['The Indian Express']\n",
      "- **Organization**\n",
      "  - `id`: STRING Available options: ['Vishva Hindu Parishad', 'Japanese Embassy']\n",
      "- **Demon-king**\n",
      "  - `id`: STRING Available options: ['Ravana']\n",
      "- **Sect**\n",
      "  - `id`: STRING Available options: ['Vaishnavism']\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Document)-[:MENTIONS]->(:Prince)\n",
      "(:Document)-[:MENTIONS]->(:Deity)\n",
      "(:Document)-[:MENTIONS]->(:Person)\n",
      "(:Document)-[:MENTIONS]->(:Character)\n",
      "(:Document)-[:MENTIONS]->(:Kingdom)\n",
      "(:Document)-[:MENTIONS]->(:City)\n",
      "(:Document)-[:MENTIONS]->(:Location)\n",
      "(:Document)-[:MENTIONS]->(:State)\n",
      "(:Document)-[:MENTIONS]->(:Religion)\n",
      "(:Document)-[:MENTIONS]->(:Text)\n",
      "(:Document)-[:MENTIONS]->(:Scholar)\n",
      "(:Document)-[:MENTIONS]->(:Epic)\n",
      "(:Document)-[:MENTIONS]->(:Story)\n",
      "(:Document)-[:MENTIONS]->(:Queen)\n",
      "(:Document)-[:MENTIONS]->(:King)\n",
      "(:Document)-[:MENTIONS]->(:Demon-king)\n",
      "(:Document)-[:MENTIONS]->(:Film)\n",
      "(:Document)-[:MENTIONS]->(:Country)\n",
      "(:Document)-[:MENTIONS]->(:Festival)\n",
      "(:Document)-[:MENTIONS]->(:Actor)\n",
      "(:Document)-[:MENTIONS]->(:Documentary film)\n",
      "(:Document)-[:MENTIONS]->(:Documentary)\n",
      "(:Document)-[:MENTIONS]->(:Newspaper)\n",
      "(:Document)-[:MENTIONS]->(:Organization)\n",
      "(:Document)-[:MENTIONS]->(:Sect)\n",
      "(:Document)-[:MENTIONS]->(:Author)\n",
      "(:Author)-[:AUTHOR]->(:Epic)\n",
      "(:Author)-[:AUTHOR]->(:Story)\n",
      "(:Prince)-[:AVATAR]->(:Deity)\n",
      "(:Prince)-[:PRINCE]->(:Kingdom)\n",
      "(:Prince)-[:PRINCE]->(:City)\n",
      "(:Prince)-[:PRINCE]->(:Location)\n",
      "(:Prince)-[:HUSBAND]->(:Queen)\n",
      "(:Prince)-[:HUSBAND]->(:Person)\n",
      "(:Prince)-[:HUSBAND]->(:Character)\n",
      "(:Prince)-[:BROTHER]->(:Prince)\n",
      "(:Prince)-[:BROTHER]->(:Person)\n",
      "(:Prince)-[:BROTHER]->(:Character)\n",
      "(:Prince)-[:KING]->(:State)\n",
      "(:Prince)-[:PART_OF]->(:Kingdom)\n",
      "(:Prince)-[:PART_OF]->(:Religion)\n",
      "(:Prince)-[:MENTIONED_IN]->(:Religion)\n",
      "(:Prince)-[:MENTIONED_IN]->(:Text)\n",
      "(:Prince)-[:EXILED_TO]->(:Location)\n",
      "(:Prince)-[:ASSOCIATED_WITH]->(:Religion)\n",
      "(:Prince)-[:AVATAR_OF]->(:Deity)\n",
      "(:Prince)-[:HONORED_IN]->(:Festival)\n",
      "(:Prince)-[:SON_OF]->(:Person)\n",
      "(:Prince)-[:SON_OF]->(:Character)\n",
      "(:Prince)-[:BORN_IN]->(:Kingdom)\n",
      "(:Prince)-[:BORN_IN]->(:City)\n",
      "(:Prince)-[:BORN_IN]->(:Location)\n",
      "(:Prince)-[:BROTHER_OF]->(:Prince)\n",
      "(:Prince)-[:BROTHER_OF]->(:Person)\n",
      "(:Prince)-[:BROTHER_OF]->(:Character)\n",
      "(:Prince)-[:BROTHER_OF]->(:Deity)\n",
      "(:Prince)-[:HUSBAND_OF]->(:Queen)\n",
      "(:Prince)-[:HUSBAND_OF]->(:Person)\n",
      "(:Prince)-[:HUSBAND_OF]->(:Character)\n",
      "(:Prince)-[:ENEMY_OF]->(:King)\n",
      "(:Prince)-[:ENEMY_OF]->(:Person)\n",
      "(:Prince)-[:ENEMY_OF]->(:Character)\n",
      "(:Prince)-[:ENEMY_OF]->(:Demon-king)\n",
      "(:Prince)-[:IMPORTANT_TO]->(:Sect)\n",
      "(:Prince)-[:MAIN_CHARACTER_OF]->(:Epic)\n",
      "(:Prince)-[:MAIN_CHARACTER_OF]->(:Story)\n",
      "(:Prince)-[:KING_OF]->(:Kingdom)\n",
      "(:Prince)-[:KING_OF]->(:City)\n",
      "(:Prince)-[:KING_OF]->(:Location)\n",
      "(:Deity)-[:AVATAR]->(:Deity)\n",
      "(:Deity)-[:PRINCE]->(:Kingdom)\n",
      "(:Deity)-[:PRINCE]->(:City)\n",
      "(:Deity)-[:PRINCE]->(:Location)\n",
      "(:Deity)-[:HUSBAND]->(:Queen)\n",
      "(:Deity)-[:HUSBAND]->(:Person)\n",
      "(:Deity)-[:HUSBAND]->(:Character)\n",
      "(:Deity)-[:BROTHER]->(:Prince)\n",
      "(:Deity)-[:BROTHER]->(:Person)\n",
      "(:Deity)-[:BROTHER]->(:Character)\n",
      "(:Deity)-[:KING]->(:State)\n",
      "(:Deity)-[:PART_OF]->(:Kingdom)\n",
      "(:Deity)-[:PART_OF]->(:Religion)\n",
      "(:Deity)-[:MENTIONED_IN]->(:Religion)\n",
      "(:Deity)-[:MENTIONED_IN]->(:Text)\n",
      "(:Deity)-[:EXILED_TO]->(:Location)\n",
      "(:Deity)-[:ASSOCIATED_WITH]->(:Religion)\n",
      "(:Deity)-[:AVATAR_OF]->(:Deity)\n",
      "(:Deity)-[:AVATAR_OF]->(:Person)\n",
      "(:Deity)-[:HONORED_IN]->(:Festival)\n",
      "(:Deity)-[:SON_OF]->(:Person)\n",
      "(:Deity)-[:SON_OF]->(:Character)\n",
      "(:Deity)-[:BORN_IN]->(:Kingdom)\n",
      "(:Deity)-[:BORN_IN]->(:City)\n",
      "(:Deity)-[:BORN_IN]->(:Location)\n",
      "(:Deity)-[:BROTHER_OF]->(:Prince)\n",
      "(:Deity)-[:BROTHER_OF]->(:Person)\n",
      "(:Deity)-[:BROTHER_OF]->(:Character)\n",
      "(:Deity)-[:HUSBAND_OF]->(:Queen)\n",
      "(:Deity)-[:HUSBAND_OF]->(:Person)\n",
      "(:Deity)-[:HUSBAND_OF]->(:Character)\n",
      "(:Deity)-[:ENEMY_OF]->(:King)\n",
      "(:Deity)-[:ENEMY_OF]->(:Person)\n",
      "(:Deity)-[:ENEMY_OF]->(:Character)\n",
      "(:Deity)-[:ENEMY_OF]->(:Demon-king)\n",
      "(:Deity)-[:IMPORTANT_TO]->(:Sect)\n",
      "(:Deity)-[:MAIN_CHARACTER_OF]->(:Epic)\n",
      "(:Deity)-[:MAIN_CHARACTER_OF]->(:Story)\n",
      "(:Deity)-[:KING_OF]->(:Kingdom)\n",
      "(:Deity)-[:KING_OF]->(:City)\n",
      "(:Deity)-[:KING_OF]->(:Location)\n",
      "(:Kingdom)-[:PART_OF]->(:Kingdom)\n",
      "(:Kingdom)-[:COEXISTED_WITH]->(:Kingdom)\n",
      "(:King)-[:FATHER]->(:Prince)\n",
      "(:King)-[:FATHER]->(:Deity)\n",
      "(:King)-[:FATHER]->(:Person)\n",
      "(:King)-[:FATHER]->(:Character)\n",
      "(:King)-[:ABDUCTOR_OF]->(:Queen)\n",
      "(:King)-[:ABDUCTOR_OF]->(:Person)\n",
      "(:King)-[:ABDUCTOR_OF]->(:Character)\n",
      "(:King)-[:KING_OF]->(:Kingdom)\n",
      "(:King)-[:KING_OF]->(:Location)\n",
      "(:King)-[:KIDNAPPER]->(:Queen)\n",
      "(:King)-[:KIDNAPPER]->(:Person)\n",
      "(:King)-[:KIDNAPPER]->(:Character)\n",
      "(:Queen)-[:WIFE_OF]->(:Person)\n",
      "(:Queen)-[:WIFE_OF]->(:Character)\n",
      "(:Queen)-[:WIFE_OF]->(:Prince)\n",
      "(:Queen)-[:WIFE_OF]->(:Deity)\n",
      "(:Queen)-[:STEPMOTHER]->(:Prince)\n",
      "(:Queen)-[:STEPMOTHER]->(:Deity)\n",
      "(:Queen)-[:STEPMOTHER]->(:Person)\n",
      "(:Queen)-[:STEPMOTHER]->(:Character)\n",
      "(:State)-[:CAPITAL]->(:Kingdom)\n",
      "(:State)-[:CAPITAL]->(:City)\n",
      "(:State)-[:CAPITAL]->(:Location)\n",
      "(:Person)-[:AVATAR]->(:Deity)\n",
      "(:Person)-[:PRINCE]->(:Kingdom)\n",
      "(:Person)-[:PRINCE]->(:City)\n",
      "(:Person)-[:PRINCE]->(:Location)\n",
      "(:Person)-[:HUSBAND]->(:Queen)\n",
      "(:Person)-[:HUSBAND]->(:Person)\n",
      "(:Person)-[:HUSBAND]->(:Character)\n",
      "(:Person)-[:BROTHER]->(:Prince)\n",
      "(:Person)-[:BROTHER]->(:Person)\n",
      "(:Person)-[:BROTHER]->(:Character)\n",
      "(:Person)-[:KING]->(:State)\n",
      "(:Person)-[:PART_OF]->(:Kingdom)\n",
      "(:Person)-[:PART_OF]->(:Religion)\n",
      "(:Person)-[:MENTIONED_IN]->(:Religion)\n",
      "(:Person)-[:MENTIONED_IN]->(:Text)\n",
      "(:Person)-[:EXILED_TO]->(:Location)\n",
      "(:Person)-[:ASSOCIATED_WITH]->(:Religion)\n",
      "(:Person)-[:ASSOCIATED_WITH]->(:Documentary film)\n",
      "(:Person)-[:ASSOCIATED_WITH]->(:Documentary)\n",
      "(:Person)-[:AVATAR_OF]->(:Deity)\n",
      "(:Person)-[:HONORED_IN]->(:Festival)\n",
      "(:Person)-[:SON_OF]->(:Person)\n",
      "(:Person)-[:SON_OF]->(:Character)\n",
      "(:Person)-[:BORN_IN]->(:Kingdom)\n",
      "(:Person)-[:BORN_IN]->(:City)\n",
      "(:Person)-[:BORN_IN]->(:Location)\n",
      "(:Person)-[:BROTHER_OF]->(:Prince)\n",
      "(:Person)-[:BROTHER_OF]->(:Person)\n",
      "(:Person)-[:BROTHER_OF]->(:Character)\n",
      "(:Person)-[:BROTHER_OF]->(:Deity)\n",
      "(:Person)-[:HUSBAND_OF]->(:Queen)\n",
      "(:Person)-[:HUSBAND_OF]->(:Person)\n",
      "(:Person)-[:HUSBAND_OF]->(:Character)\n",
      "(:Person)-[:ENEMY_OF]->(:King)\n",
      "(:Person)-[:ENEMY_OF]->(:Person)\n",
      "(:Person)-[:ENEMY_OF]->(:Character)\n",
      "(:Person)-[:ENEMY_OF]->(:Demon-king)\n",
      "(:Person)-[:IMPORTANT_TO]->(:Sect)\n",
      "(:Person)-[:MAIN_CHARACTER_OF]->(:Epic)\n",
      "(:Person)-[:MAIN_CHARACTER_OF]->(:Story)\n",
      "(:Person)-[:KING_OF]->(:Kingdom)\n",
      "(:Person)-[:KING_OF]->(:City)\n",
      "(:Person)-[:KING_OF]->(:Location)\n",
      "(:Person)-[:WIFE_OF]->(:Person)\n",
      "(:Person)-[:WIFE_OF]->(:Character)\n",
      "(:Person)-[:WIFE_OF]->(:Prince)\n",
      "(:Person)-[:WIFE_OF]->(:Deity)\n",
      "(:Person)-[:STEPMOTHER]->(:Prince)\n",
      "(:Person)-[:STEPMOTHER]->(:Deity)\n",
      "(:Person)-[:STEPMOTHER]->(:Person)\n",
      "(:Person)-[:STEPMOTHER]->(:Character)\n",
      "(:Person)-[:ABDUCTOR_OF]->(:Queen)\n",
      "(:Person)-[:ABDUCTOR_OF]->(:Person)\n",
      "(:Person)-[:ABDUCTOR_OF]->(:Character)\n",
      "(:Person)-[:KIDNAPPER]->(:Queen)\n",
      "(:Person)-[:KIDNAPPER]->(:Person)\n",
      "(:Person)-[:KIDNAPPER]->(:Character)\n",
      "(:Person)-[:PRODUCER]->(:Film)\n",
      "(:Person)-[:WORKED_ON]->(:Documentary film)\n",
      "(:Person)-[:WORKED_ON]->(:Documentary)\n",
      "(:Person)-[:RESEARCHED]->(:Epic)\n",
      "(:Person)-[:RESEARCHED]->(:Story)\n",
      "(:Person)-[:CREATED]->(:Documentary film)\n",
      "(:Person)-[:CREATED]->(:Documentary)\n",
      "(:Person)-[:DIRECTOR]->(:Film)\n",
      "(:Person)-[:COMPOSER]->(:Film)\n",
      "(:Person)-[:RESIDENT_OF]->(:Location)\n",
      "(:Person)-[:HELPER_OF]->(:Prince)\n",
      "(:Person)-[:HELPER_OF]->(:Deity)\n",
      "(:Person)-[:HELPER_OF]->(:Person)\n",
      "(:Person)-[:HELPER_OF]->(:Character)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Prince)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Deity)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Person)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Character)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Queen)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:King)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Demon-king)\n",
      "(:Person)-[:VOICE_ACTOR_OF]->(:Film)\n",
      "(:Person)-[:PORTRAYED]->(:Person)\n",
      "(:Person)-[:PORTRAYED]->(:Character)\n",
      "(:Person)-[:PORTRAYED]->(:Queen)\n",
      "(:City)-[:PART_OF]->(:Kingdom)\n",
      "(:Scholar)-[:SCHOLAR]->(:Epic)\n",
      "(:Scholar)-[:SCHOLAR]->(:Story)\n",
      "(:Film)-[:SCREENED_AT]->(:Festival)\n",
      "(:Country)-[:CO-PRODUCER]->(:Film)\n",
      "(:Location)-[:PART_OF]->(:Kingdom)\n",
      "(:Location)-[:CO-PRODUCER]->(:Film)\n",
      "(:Actor)-[:VOICE_ACTOR_OF]->(:Person)\n",
      "(:Actor)-[:VOICE_ACTOR_OF]->(:Character)\n",
      "(:Actor)-[:VOICE_ACTOR_OF]->(:Queen)\n",
      "(:Actor)-[:PORTRAYED]->(:Person)\n",
      "(:Actor)-[:PORTRAYED]->(:Character)\n",
      "(:Actor)-[:PORTRAYED]->(:Queen)\n",
      "(:Actor)-[:PORTRAYED]->(:Prince)\n",
      "(:Actor)-[:PORTRAYED]->(:Deity)\n",
      "(:Actor)-[:PORTRAYED]->(:King)\n",
      "(:Actor)-[:PORTRAYED]->(:Demon-king)\n",
      "(:Character)-[:AVATAR]->(:Deity)\n",
      "(:Character)-[:PRINCE]->(:Kingdom)\n",
      "(:Character)-[:PRINCE]->(:City)\n",
      "(:Character)-[:PRINCE]->(:Location)\n",
      "(:Character)-[:HUSBAND]->(:Queen)\n",
      "(:Character)-[:HUSBAND]->(:Person)\n",
      "(:Character)-[:HUSBAND]->(:Character)\n",
      "(:Character)-[:BROTHER]->(:Prince)\n",
      "(:Character)-[:BROTHER]->(:Person)\n",
      "(:Character)-[:BROTHER]->(:Character)\n",
      "(:Character)-[:KING]->(:State)\n",
      "(:Character)-[:PART_OF]->(:Kingdom)\n",
      "(:Character)-[:PART_OF]->(:Religion)\n",
      "(:Character)-[:MENTIONED_IN]->(:Religion)\n",
      "(:Character)-[:MENTIONED_IN]->(:Text)\n",
      "(:Character)-[:EXILED_TO]->(:Location)\n",
      "(:Character)-[:ASSOCIATED_WITH]->(:Religion)\n",
      "(:Character)-[:AVATAR_OF]->(:Deity)\n",
      "(:Character)-[:HONORED_IN]->(:Festival)\n",
      "(:Character)-[:SON_OF]->(:Person)\n",
      "(:Character)-[:SON_OF]->(:Character)\n",
      "(:Character)-[:BORN_IN]->(:Kingdom)\n",
      "(:Character)-[:BORN_IN]->(:City)\n",
      "(:Character)-[:BORN_IN]->(:Location)\n",
      "(:Character)-[:BROTHER_OF]->(:Prince)\n",
      "(:Character)-[:BROTHER_OF]->(:Person)\n",
      "(:Character)-[:BROTHER_OF]->(:Character)\n",
      "(:Character)-[:BROTHER_OF]->(:Deity)\n",
      "(:Character)-[:HUSBAND_OF]->(:Queen)\n",
      "(:Character)-[:HUSBAND_OF]->(:Person)\n",
      "(:Character)-[:HUSBAND_OF]->(:Character)\n",
      "(:Character)-[:ENEMY_OF]->(:King)\n",
      "(:Character)-[:ENEMY_OF]->(:Person)\n",
      "(:Character)-[:ENEMY_OF]->(:Character)\n",
      "(:Character)-[:ENEMY_OF]->(:Demon-king)\n",
      "(:Character)-[:IMPORTANT_TO]->(:Sect)\n",
      "(:Character)-[:MAIN_CHARACTER_OF]->(:Epic)\n",
      "(:Character)-[:MAIN_CHARACTER_OF]->(:Story)\n",
      "(:Character)-[:KING_OF]->(:Kingdom)\n",
      "(:Character)-[:KING_OF]->(:City)\n",
      "(:Character)-[:KING_OF]->(:Location)\n",
      "(:Character)-[:WIFE_OF]->(:Person)\n",
      "(:Character)-[:WIFE_OF]->(:Character)\n",
      "(:Character)-[:WIFE_OF]->(:Prince)\n",
      "(:Character)-[:WIFE_OF]->(:Deity)\n",
      "(:Character)-[:STEPMOTHER]->(:Prince)\n",
      "(:Character)-[:STEPMOTHER]->(:Deity)\n",
      "(:Character)-[:STEPMOTHER]->(:Person)\n",
      "(:Character)-[:STEPMOTHER]->(:Character)\n",
      "(:Character)-[:ABDUCTOR_OF]->(:Queen)\n",
      "(:Character)-[:ABDUCTOR_OF]->(:Person)\n",
      "(:Character)-[:ABDUCTOR_OF]->(:Character)\n",
      "(:Character)-[:KIDNAPPER]->(:Queen)\n",
      "(:Character)-[:KIDNAPPER]->(:Person)\n",
      "(:Character)-[:KIDNAPPER]->(:Character)\n",
      "(:Character)-[:RESIDENT_OF]->(:Location)\n",
      "(:Newspaper)-[:PUBLISHED]->(:Documentary film)\n",
      "(:Newspaper)-[:PUBLISHED]->(:Documentary)\n",
      "(:Organization)-[:PROTESTED]->(:Organization)\n",
      "(:Demon-king)-[:ABDUCTOR_OF]->(:Queen)\n",
      "(:Demon-king)-[:ABDUCTOR_OF]->(:Person)\n",
      "(:Demon-king)-[:ABDUCTOR_OF]->(:Character)\n",
      "(:Demon-king)-[:KING_OF]->(:Kingdom)\n",
      "(:Demon-king)-[:KING_OF]->(:Location)\n",
      "(:Demon-king)-[:KIDNAPPER]->(:Queen)\n",
      "(:Demon-king)-[:KIDNAPPER]->(:Person)\n",
      "(:Demon-king)-[:KIDNAPPER]->(:Character)\n"
     ]
    }
   ],
   "source": [
    "print(kg.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "84e5a4af",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pydantic import BaseModel, Field\n",
    "from typing import List\n",
    "\n",
    "class Entities(BaseModel):\n",
    "    \"\"\"Identifying information about entities.\"\"\"\n",
    "\n",
    "    names: List[str] = Field(\n",
    "        ...,\n",
    "        description=\"All the person, organization, or business entities that \"\n",
    "        \"appear in the text\",\n",
    "    )\n",
    "\n",
    "prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            \"You are extracting organization and person entities from the text.\",\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            \"Use the given format to extract information from the following \"\n",
    "            \"input: {question}\",\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "entity_chain = prompt | llm.with_structured_output(Entities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "3e8b52c9",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_full_text_query(input: str) -> str:\n",
    "    \"\"\"\n",
    "    Generate a full-text search query for a given input string.\n",
    "\n",
    "    This function constructs a query string suitable for a full-text search.\n",
    "    It processes the input string by splitting it into words and appending a\n",
    "    similarity threshold (~2 changed characters) to each word, then combines \n",
    "    them using the AND operator. Useful for mapping entities from user questions\n",
    "    to database values, and allows for some misspelings.\n",
    "    \"\"\"\n",
    "    full_text_query = \"\"\n",
    "    words = [el for el in remove_lucene_chars(input).split() if el]\n",
    "    for word in words[:-1]:\n",
    "        full_text_query += f\" {word}~2 AND\"\n",
    "    full_text_query += f\" {words[-1]}~2\"\n",
    "    return full_text_query.strip()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "d1feabdc",
   "metadata": {},
   "outputs": [],
   "source": [
    "def structured_retriever(question: str) -> str:\n",
    "    \"\"\"\n",
    "    Collects the neighborhood of entities mentioned\n",
    "    in the question\n",
    "    \"\"\"\n",
    "    result = \"\"\n",
    "    entities = entity_chain.invoke({\"question\": question})\n",
    "    for entity in entities.names:\n",
    "        response = kg.query(\n",
    "            \"\"\"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\n",
    "            YIELD node,score\n",
    "            CALL {\n",
    "              MATCH (node)-[r:!MENTIONS]->(neighbor)\n",
    "              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\n",
    "              UNION\n",
    "              MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
    "              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\n",
    "            }\n",
    "            RETURN output\n",
    "            \"\"\",\n",
    "            {\"query\": generate_full_text_query(entity)},\n",
    "        )\n",
    "        result += \"\\n\".join([el['output'] for el in response])\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "cb67e1fd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def retriever(question: str):\n",
    "    print(f\"Search query: {question}\")\n",
    "    structured_data = structured_retriever(question)\n",
    "    final_data = f\"\"\"Structured data:\n",
    "{structured_data}\n",
    "    \"\"\"\n",
    "    return final_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "4f657632",
   "metadata": {},
   "outputs": [],
   "source": [
    "def answer_question(question: str):\n",
    "    context = retriever(question)\n",
    "    template = \"\"\"Answer the question based only on the following context:\n",
    "{context}\n",
    "Question: {question}\"\"\"\n",
    "    prompt = ChatPromptTemplate.from_messages([\n",
    "        (\"system\", \"You are to convert structured data into a clean, human-readable answer. Also print the relevent structure data you are refering from the context.\"),\n",
    "        (\"human\", template),\n",
    "    ])\n",
    "    messages = prompt.format_messages(context=context, question=question)\n",
    "    response = llm(messages)\n",
    "    return response.content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "0963fe74",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Search query: how is Kritarth Trivedi related to Rama\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output\\n            \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output\\n            \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There is no information in the provided structured data about Kritarth Trivedi or their relation to Rama. \n",
      "\n",
      "Relevant structured data: None\n",
      "Search query: who is the author of ramayana\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output\\n            \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output\\n            \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The author of the Ramayana is Valmiki.\n",
      "\n",
      "Relevant structured data:\n",
      "Valmiki - AUTHOR -> Ramayana\n"
     ]
    }
   ],
   "source": [
    "print(answer_question(\"how is Kritarth Trivedi related to Rama\"))\n",
    "print(answer_question(\"who is the author of ramayana\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0d026f20",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graph",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
